/*
Разработать приложение, создающее список плоских геометрических фигур
(круг, квадрат, треугольник и т.д., но не менее 5 фигур).
Создание списка должно быть реализовано несколькими способами
(ввод с клавиатуры, чтение из файла, генерирование случайным образом).
Далее необходимо вывести данные о тех фигурах, площадь которых меньше средней площади всех фигур.
При этом вычисление площади фигур может производиться обычным способом, а может округляться по избытку,
по недостатку или до ближайшего значения до указанного пользователем количества знаков после запятой
(вид округления тоже указывается пользователем).
Округление реализовать самостоятельно (через соответствующие методы класса Math),
используя шаблон проектирования «Decorator».
 */
public class Task_02 {
}
